const plain = [
    // row 0
    ['[Backquote]', '`', '~'],
    ['1', '1', '!'],
    ['2', '2', '"'],
    ['3', '3', '№'],
    ['4', '4', ';'],
    ['5', '5', '%'],
    ['6', '6', ':'],
    ['7', '7', '?'],
    ['8', '8', '*'],
    ['9', '(', '('],
    ['0', ')', ')'],
    ['[Minus]', '-', '_'],
    ['[Equal]', '=', '+'],

    // row 1
    ['q', 'й', 'Й'],
    ['w', 'ц', 'Ц'],
    ['e', 'у', 'У'],
    ['r', 'к', 'К'],
    ['t', 'е', 'Е'],
    ['y', 'н', 'Н'],
    ['u', 'г', 'Г'],
    ['i', 'ш', 'Ш'],
    ['o', 'щ', 'Щ'],
    ['p', 'з', 'З'],
    ['[BracketLeft]', 'х', 'Х'],
    ['[BracketRight]', 'ъ', 'Ъ'],
    ['[Backslash]', '\\', '/'],

    // row 2
    ['a', 'ф', 'Ф'],
    ['s', 'ы', 'Ы'],
    ['d', 'в', 'В'],
    ['f', 'а', 'А'],
    ['g', 'п', 'П'],
    ['h', 'р', 'Р'],
    ['j', 'о', 'О'],
    ['k', 'л', 'Л'],
    ['l', 'д', 'Д'],
    ['[Semicolon]', 'ж', 'Ж'],
    ["[Quote]", 'э', 'Э'],

    // row 3
    ['z', 'я', 'Я'],
    ['x', 'ч', 'Ч'],
    ['c', 'с', 'С'],
    ['v', 'м', 'М'],
    ['b', 'и', 'И'],
    ['n', 'т', 'Т'],
    ['m', 'ь', 'Ь'],
    ['[Comma]', 'б', 'Б'],
    ['[Period]', 'ю', 'Ю'],
    ['[Slash]', '.', ','],
];

const mod = [
    // row 0
    ['[Backquote]', '\u0451', '\u0401'],
    ['1', '\u0482', '\u200D'],
    ['2', '\u0483', '\uA67E'],
    ['3', '\u0300', '\u0486\u0300'],
    ['4', '\u0487', '\uA67C'],
    ['5', '\u0486', '\u0311'],
    ['6', '\u030F', '\u1DC0'],
    ['7', '\u0301', '\u0486\u0301'],
    ['8', '\u047F', '\u047E'],
    ['9', '\u0461', '\u0460'],
    ['0', '\u1C82', '\u2DEA\u0487'],
    ['[Minus]', '\uA64D', '\uA64C'],
    ['[Equal]', '\uA673', '\u2720'],

    // row 1
    ['q', '\u0456\u0308', '\u0406\u0308'],
    ['w', '\uA641', '\uA640'],
    ['e', '\uA64B', '\uA64A'],
    ['r', '\u046F', '\u046E'],
    ['t', '\u0454', '\u0404'],
    ['y', '\u2DE9\u0487', ''],  //FIXME: no 4-byte unicode?
    ['u', '\u2DE2\u0487', ''],  //FIXME: no 4-byte unicode?
    ['i', '\u2DF9\u0487', ''],  //FIXME: no 4-byte unicode?
    ['o', '\u2DF3\u0487', ''],  //FIXME: no 4-byte unicode?
    ['p', '\u0455', '\u0405'],
    ['[BracketLeft]', '\u2DEF', ''],  //FIXME: no 4-byte unicode?
    ['[BracketRight]', '\u033e', '\u2E2F'],
    ['[Backslash]', '\u047D', '\u047C'],

    // row 2
    ['a', '\u0473', '\U0472'],
    ['s', '\u0475', '\U0474'],
    ['d', '\u2DE1\u0487', '\u1C80'],
    ['f', '\uA657', '\uA656'],
    ['g', '\u0471', '\u0470'],
    ['h', '\u2DEC\u0487', ''],
    ['j', '\u047B', '\u047A'],
    ['k', '\u2DE7\u0487', ''],
    ['l', '\u2DE3', '\u1C81'],
    ['[Semicolon]', '\u2DE4', ''],
    ["[Quote]", '\u0463', '\u0462'],

    // row 3
    ['z', '\u0467', '\u0466'],
    ['x', '\u045F', '\u040F'],
    ['c', '\u2DED\u0487', '\u1C83'],
    ['v', '\u2DE8', ''],  // FIXME: 4-byte unicode
    ['b', '\u0456', '\u0406'],
    ['n', '\u1C85', '\u1C84'],
    ['m', '\uA67D', '\uA67F'],
    ['[Comma]', '\u2DE0\u0487', ''],
    ['[Period]', '\u045B', '\u046A'],
    ['[Slash]', '\uA65F', '\uA65E'],

];

const deadPlain = [
    ['f', '\u2DF6', '\u2DF6'],
    ['[Comma]', '\u2DE0', '\u2DE0'],
    ['d', '\u2DE1', '\u2DE1'],
    ['u', '\u2DE2', '\u2DE2'],
    ['l', '\u2DE3', '\u2DE3'],
    ['t', '\u2DF7', '\u2DF7'],
    ['[Semicolon]', '\u2DE4', '\u2DE4'],
    ['p', '\u2DE5', '\u2DE5'],
    ['b', '\uA675', '\uA675'],
    ['q', '\uA675', '\uA675'],
    ['r', '\u2DE6', '\u2DE6'],
    ['k', '\u2DE7', '\u2DE7'],
    ['v', '\u2DE8', '\u2DE8'],
    ['y', '\u2DE9', '\u2DE9'],
    ['j', '\u2DEA', '\u2DEA'],
    ['g', '\u2DEB', '\u2DEB'],
    ['h', '\u2DEC', '\u2DEC'],
    ['c', '\u2DED', '\u2DED'],
    ['n', '\u2DEE', '\u2DEE'],
    ['e', '\uA677', '\uA677'],
    ['a', '\uA69E', '\uA69E'],
    ['[BracketLeft]', '\u2DEF', '\u2DEF'],
    ['w', '\u2DF0', '\u2DF0'],
    ['x', '\u2DF1', '\u2DF1'],
    ['i', '\u2DF2', '\u2DF2'],
    ['o', '\u2DF3', '\u2DF3'],
    ['[BracketRight]', '\uA678', '\uA678'],
    ['s', '\uA679', '\uA679'],
    ['m', '\uA67A', '\uA67A'],
    ['[Period]', '\u2DBF', '\u2DBF'],
];

const deadMod = [
    ['t', '\uA674', '\uA674'],
    ['b', '\uA676', '\uA676'],
    ['j', '\u2DEA', '\u2DEA'],
    ['0', '\u2DEA', '\u2DEA'],
    ['9', '\uA67B', '\uA67B'],
    ['[Minus]', '\uA67B', '\uA67B'],
    ['n', '\u2DEE', '\u2DEE'],
    ['e', '\u2DF9', '\u2DF9'],
    ['[Quote]', '\u2DFA', '\u2DFA'],
    ['z', '\u2DFD', '\u2DFD'],
    ['f', '\u2DFC', '\u2DFC'],
    ['[Period]', '\u2DFE', '\u2DFE'],
    ['a', '\u2DF4', '\u2DF4'],
    ['c', '\u2DED', '\u2DED'],
]

module.exports = {
    plain,
    mod,
    deadPlain,
    deadMod
}